tutorials/multiphaseEuler/condenser/0/T.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [temperature];

internalField   uniform 298.15;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      $internalField;
    }
    wall
    {
        type            multiphaseExternalTemperature;
        Ta              283.15;

        h
        {
            type            externalWallLayersHeatTransferCoefficient;
            h               10000;
            thicknessLayers (0.045);
            kappaLayers     (117);
        }

        relaxation      0.2;
        value           $internalField;
    }
}


// ************************************************************************* //
